<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#La-connexion-à-la-base-de-données-Oracle" data-toc-modified-id="La-connexion-à-la-base-de-données-Oracle-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>La connexion à la base de données Oracle</a></span><ul class="toc-item"><li><span><a href="#La-connexion-avec-sqlalchemy" data-toc-modified-id="La-connexion-avec-sqlalchemy-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>La connexion avec <code>sqlalchemy</code></a></span></li></ul></li><li><span><a href="#Les-regroupements" data-toc-modified-id="Les-regroupements-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Les regroupements</a></span><ul class="toc-item"><li><span><a href="#La-copy-d'un-DataFrame" data-toc-modified-id="La-copy-d'un-DataFrame-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>La copy d'un DataFrame</a></span></li><li><span><a href="#Le-groupby" data-toc-modified-id="Le-groupby-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Le groupby</a></span></li><li><span><a href="#Assign" data-toc-modified-id="Assign-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Assign</a></span></li></ul></li><li><span><a href="#Les-équijointures" data-toc-modified-id="Les-équijointures-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Les équijointures</a></span></li><li><span><a href="#Les-jointures-externes" data-toc-modified-id="Les-jointures-externes-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Les jointures externes</a></span></li></ul></div>

https://www.sqlalchemy.org
!conda install sqlalchemy
!pip   install ipython-sql
!pip   install sql
!conda install cx_Oracle
!pip install psycopg2
!conda install pymysql

In [4]:
import pandas as pd 
import seaborn as sns
import warnings 
import os
import cx_Oracle

from datetime import datetime
warnings.filterwarnings(action="ignore")

%pylab inline
%load_ext sql

sys.path.append(os.path.abspath('../../.'))
from dbconnect import utilisateur,connexion,password

%sql oracle+cx_oracle://$utilisateur:$password@$connexion
        
plt.style.use('seaborn-darkgrid')
sns.set(font_scale=3)

Populating the interactive namespace from numpy and matplotlib
The sql extension is already loaded. To reload it, use:
  %reload_ext sql

# La connexion à la base de données Oracle

**`oracle+cx_oracle://user:pass@host:port/dbname[?key=value&key=value...]`**<br>
**`engine = create_engine("oracle+cx_oracle://scott:tiger@oracle1120/?encoding=UTF-8&nencoding=UTF-8")`**<br>
**`sqlplus stag01/Phoenix#Icar67@51.91.76.248:15440/coursdb`**<br>

## La connexion avec `sqlalchemy`

In [5]:
connection = cx_Oracle.connect(utilisateur, password, connexion)

La lecture d'une table et le chargement dans un DataFrame

In [6]:
query = """
            select * 
            from categories
         """
categories = pd.read_sql_query(query, connection) #df.to_sql('nom', con=engine,if_exists='replace')
categories

,CODE_CATEGORIE,NOM_CATEGORIE,DESCRIPTION
0,1,Boissons,"Boissons, cafés, thés, bières"
1,2,Condiments,"Sauces, assaisonnements et épices"
2,3,Desserts,Desserts et friandises
3,4,Produits laitiers,Fromages
4,5,Pâtes et céréales,"Pains, biscuits, pâtes et céréales"
5,6,Viandes,Viandes préparées
6,7,Produits secs,"Fruits secs, raisins, autres"
7,8,Poissons et fruits de mer,"Poissons, fruits de mer, escargots"
8,9,Conserves,"Fruits, légumes en conserve et confitures"
9,10,Viande en conserve,Viande en conserve
10,666,AAA,abcd
11,100000,Fruits et legumes,pas de description

# Les regroupements

In [6]:
print("connecting with engine " + str(engine))
connection = engine.connect()
query = """
            select * 
            from commandes co 
                 join details_commandes dc 
                 on co.no_commande = dc.no_commande
            --FETCH FIRST 100 ROWS ONLY
         """
df = pd.read_sql_query(query, connection) #df.to_sql('nom', con=engine,if_exists='replace')
df.shape

connecting with engine Engine(oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb)

(476091, 19)

## La copy d'un DataFrame

In [7]:
det_comm = df.copy()
det_comm.columns

Index(['no_commande', 'code_client', 'no_employe', 'date_commande',
       'date_envoi', 'port', 'livree', 'acquitee', 'annulee', 'annee',
       'trimestre', 'mois', 'no_commande', 'ref_produit', 'prix_unitaire',
       'quantite', 'remise', 'retourne', 'echange'],
      dtype='object')

In [8]:
det_comm.head()

,no_commande,code_client,no_employe,date_commande,date_envoi,port,livree,acquitee,annulee,annee,trimestre,mois,no_commande,ref_produit,prix_unitaire,quantite,remise,retourne,echange
0,214994,SANTG,76,2010-01-01,2010-02-06,62.3,1,1,0,2010,1,1,214994,87,62.16,34,10.30,0,0
1,214994,SANTG,76,2010-01-01,2010-02-06,62.3,1,1,0,2010,1,1,214994,49,88.20,89,13.52,0,0
2,214994,SANTG,76,2010-01-01,2010-02-06,62.3,1,1,0,2010,1,1,214994,3,37.56,53,4.26,0,0
3,214994,SANTG,76,2010-01-01,2010-02-06,62.3,1,1,0,2010,1,1,214994,84,48.72,104,7.86,0,0
4,214994,SANTG,76,2010-01-01,2010-02-06,62.3,1,1,0,2010,1,1,214994,57,65.04,125,6.02,0,0

## Le groupby

<img src="https://raw.githubusercontent.com/rbizoi/Ecole-IA-Strasbourg/master/images/documents/M06-03.png" width="400">

In [7]:
%%sql  
select annee, 
     trimestre, 
     mois, 
     sum(quantite) quantite_sum, 
     avg(quantite) quantite_avg, 
     sum(port) port_sum, 
     min(port) port_min, 
     max(port) port_max, 
     avg(port) port_avg 
from commandes co 
   join details_commandes dc
      on co.no_commande = dc.no_commande 
group by annee,trimestre,mois 
order by annee,trimestre,mois

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(2010, 1, 1, 2586939, Decimal('110.524609074596257369905152524993591387'), Decimal('1768095.2'), 50, 100, Decimal('75.54025463556353071861915748098778091088')),
 (2010, 1, 2, 2422312, Decimal('109.458291911432444645277903298689561681'), Decimal('1652843.4'), Decimal('50.1'), 100, Decimal('74.68790781744238590149118843199276999548')),
 (2010, 1, 3, 2562429, Decimal('109.693022260273972602739726027397260274'), Decimal('1737846.9'), Decimal('50.3'), Decimal('99.9'), Decimal('74.39413099315068493150684931506849315068')),
 (2010, 2, 4, 2413987, Decimal('109.791558648292172647473507072360940556'), Decimal('1652110.2'), 50, 100, Decimal('75.14031927957429390094146541137945149406')),
 (2010, 2, 5, 2662399, Decimal('109.32080972324874763899154143056582081'), Decimal('1815609.2'), Decimal('50.1'), 100, Decimal('74.55075962880840929621417426295475075963')),
 (2010, 2, 6, 2538585, Decimal('109.412335143522110162916989914662529092'), Decimal('1731709.8'), Decimal('50.1'), Decimal('99.9'), Decimal('74.6362296353762606671838634600465477114')),
 (2010, 3, 7, 2568649, Decimal('110.512799552553456954782084928795766467'), Decimal('1755303.9'), Decimal('50.1'), Decimal('99.9'), Decimal('75.51967904315277718022630469388633136858')),
 (2010, 3, 8, 2722756, Decimal('109.974796025527102350755311414492285322'), Decimal('1867152.1'), Decimal('50.1'), 100, Decimal('75.41611196380967767994183698198562080944')),
 (2010, 3, 9, 2491305, Decimal('109.52235459621048929529168681584384754'), Decimal('1684754.6'), Decimal('50.2'), 100, Decimal('74.06491405460060667340748230535894843276')),
 (2010, 4, 10, 2823864, Decimal('109.596522549095707521540013971900954747'), 1939238, 50, 100, Decimal('75.26344795466894356904447721803927656602')),
 (2010, 4, 11, 2579959, Decimal('109.982053030948930002557762810128740728'), Decimal('1747349.4'), Decimal('50.2'), 100, Decimal('74.48842186034615056697075624520419473101')),
 (2010, 4, 12, 2458342, Decimal('109.288788121276784920423223970836667556'), Decimal('1674241.4'), Decimal('50.1'), Decimal('99.9'), Decimal('74.4305770427669600782430870454343380457')),
 (2011, 1, 1, 3473146, Decimal('109.958399290825049072373836509846134363'), Decimal('2358136.9'), 50, 100, Decimal('74.65766162223770024694484898372696764389')),
 (2011, 1, 2, 3411984, Decimal('109.830168029356853151355179295693040623'), Decimal('2331253.8'), Decimal('50.1'), 100, Decimal('75.04196871177493079250627695873302002189')),
 (2011, 1, 3, 3818542, Decimal('110.098376726350085056079347230631721593'), Decimal('2618142.1'), Decimal('50.1'), 100, Decimal('75.48776345760170688810079866216878586051')),
 (2011, 2, 4, 3586065, Decimal('110.022243357673191384917469472909124379'), Decimal('2422907.6'), Decimal('50.1'), 100, Decimal('74.33600049088789347732711542001595385654')),
 (2011, 2, 5, 3552664, Decimal('109.514919852034525277435265104808877928'), 2417137, Decimal('50.1'), 100, Decimal('74.51100493218249075215782983970406905055')),
 (2011, 2, 6, 3596965, Decimal('109.606758692141268245116860163939421641'), Decimal('2464942.7'), Decimal('50.1'), Decimal('99.9'), Decimal('75.11176219642258585489228143949782125118'))]

In [10]:
gb_dc = det_comm.groupby(['annee','trimestre','mois'])

In [11]:
gb_dc.agg({'quantite':['sum','mean'],'port':['sum','min','max','mean']}).head()

                     quantite                   port
                          sum        mean        sum   min    max       mean
annee trimestre mois
2010  1         1     2586939  110.524609  1768095.2  50.0  100.0  75.540255
                2     2422312  109.458292  1652843.4  50.1  100.0  74.687908
                3     2562429  109.693022  1737846.9  50.3   99.9  74.394131
      2         4     2413987  109.791559  1652110.2  50.0  100.0  75.140319
                5     2662399  109.320810  1815609.2  50.1  100.0  74.550760

In [12]:
gb_dc.agg({'prix_unitaire':'std'}).head()

                      prix_unitaire
annee trimestre mois
2010  1         1         16.981045
                2         16.987277
                3         17.012675
      2         4         17.048913
                5         16.992424

## Assign

In [13]:
df_dc = det_comm.assign(
                 ca_brut = det_comm.quantite*det_comm.prix_unitaire,
                 remise  = det_comm.quantite*det_comm.prix_unitaire*det_comm.remise/100,
                 ca_net  = det_comm.quantite*det_comm.prix_unitaire - 
                          (det_comm.quantite*det_comm.prix_unitaire*det_comm.remise/100)                
                ).groupby(
                          ['annee','trimestre','mois']
                         ).agg(
                               {'quantite':['sum','mean'],
                                'port'    :['sum','min','max','mean'],
                                'ca_brut' :['sum'],
                                'remise'  :['sum'],
                                'ca_net'  :['sum'],
                                 })
df_dc.head()

                     quantite                   port                          \
                          sum        mean        sum   min    max       mean
annee trimestre mois
2010  1         1     2586939  110.524609  1768095.2  50.0  100.0  75.540255
                2     2422312  109.458292  1652843.4  50.1  100.0  74.687908
                3     2562429  109.693022  1737846.9  50.3   99.9  74.394131
      2         4     2413987  109.791559  1652110.2  50.0  100.0  75.140319
                5     2662399  109.320810  1815609.2  50.1  100.0  74.550760

                           ca_brut        remise        ca_net
                               sum           sum           sum
annee trimestre mois
2010  1         1     1.698266e+08  1.487704e+07  1.549496e+08
                2     1.585268e+08  1.379942e+07  1.447274e+08
                3     1.677318e+08  1.466487e+07  1.530669e+08
      2         4     1.577834e+08  1.379868e+07  1.439847e+08
                5     1.743042e+08  1.526195e+07  1.590423e+08

In [14]:
df_dc.columns = [col[0]+'_'+col[1] for col in df_dc.columns]
df_dc.head()

                      quantite_sum  quantite_mean   port_sum  port_min  \
annee trimestre mois
2010  1         1          2586939     110.524609  1768095.2      50.0
                2          2422312     109.458292  1652843.4      50.1
                3          2562429     109.693022  1737846.9      50.3
      2         4          2413987     109.791559  1652110.2      50.0
                5          2662399     109.320810  1815609.2      50.1

                      port_max  port_mean   ca_brut_sum    remise_sum  \
annee trimestre mois
2010  1         1        100.0  75.540255  1.698266e+08  1.487704e+07
                2        100.0  74.687908  1.585268e+08  1.379942e+07
                3         99.9  74.394131  1.677318e+08  1.466487e+07
      2         4        100.0  75.140319  1.577834e+08  1.379868e+07
                5        100.0  74.550760  1.743042e+08  1.526195e+07

                        ca_net_sum
annee trimestre mois
2010  1         1     1.549496e+08
                2     1.447274e+08
                3     1.530669e+08
      2         4     1.439847e+08
                5     1.590423e+08

In [15]:
df_dc.reset_index().head()

,annee,trimestre,mois,quantite_sum,quantite_mean,port_sum,port_min,port_max,port_mean,ca_brut_sum,remise_sum,ca_net_sum
0,2010,1,1,2586939,110.524609,1768095.2,50.0,100.0,75.540255,1.698266e+08,1.487704e+07,1.549496e+08
1,2010,1,2,2422312,109.458292,1652843.4,50.1,100.0,74.687908,1.585268e+08,1.379942e+07,1.447274e+08
2,2010,1,3,2562429,109.693022,1737846.9,50.3,99.9,74.394131,1.677318e+08,1.466487e+07,1.530669e+08
3,2010,2,4,2413987,109.791559,1652110.2,50.0,100.0,75.140319,1.577834e+08,1.379868e+07,1.439847e+08
4,2010,2,5,2662399,109.320810,1815609.2,50.1,100.0,74.550760,1.743042e+08,1.526195e+07,1.590423e+08

# Les équijointures

<img src="https://raw.githubusercontent.com/rbizoi/Ecole-IA-Strasbourg/master/images/documents/M06-07.png" width="400">

In [8]:
%%sql 
select count(*) from employes

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(111,)]

In [9]:
%%sql 
select count(*) from commandes

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(13462,)]

In [11]:
%%sql 
select count(*) from clients

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(91,)]

In [12]:
%%sql 
select count(*) 
     from employes em 
          inner join commandes co 
               on em.no_employe = co.no_employe 
          inner join clients cl 
               on cl.code_client = co.code_client

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(13462,)]

In [20]:
commandes = pd.read_sql_query("select * from commandes",connection)
employes  = pd.read_sql_query("select * from employes",connection)
clients  = pd.read_sql_query("select * from clients",connection)

In [21]:
employes.merge(commandes, on='no_employe').merge(clients, on='code_client').shape

(13462, 30)

In [22]:
employes.merge(commandes, on='no_employe').merge(clients, on='code_client').head()

,no_employe,rend_compte,nom,prenom,fonction,titre,date_naissance,date_embauche,salaire,commission,...,annee,trimestre,mois,societe,adresse,ville,code_postal,pays_y,telephone,fax
0,70,95.0,Berlioz,Jacques,Représentant(e),M.,1967-10-12,1994-10-20,9400.0,980.0,...,2010,1,2,Simons bistro,Vinbæltet 34,København,1734,Danemark,31 12 34 56,31 13 35 57
1,70,95.0,Berlioz,Jacques,Représentant(e),M.,1967-10-12,1994-10-20,9400.0,980.0,...,2010,1,3,Simons bistro,Vinbæltet 34,København,1734,Danemark,31 12 34 56,31 13 35 57
2,70,95.0,Berlioz,Jacques,Représentant(e),M.,1967-10-12,1994-10-20,9400.0,980.0,...,2010,1,1,Simons bistro,Vinbæltet 34,København,1734,Danemark,31 12 34 56,31 13 35 57
3,70,95.0,Berlioz,Jacques,Représentant(e),M.,1967-10-12,1994-10-20,9400.0,980.0,...,2010,1,2,Simons bistro,Vinbæltet 34,København,1734,Danemark,31 12 34 56,31 13 35 57
4,70,95.0,Berlioz,Jacques,Représentant(e),M.,1967-10-12,1994-10-20,9400.0,980.0,...,2010,1,1,Simons bistro,Vinbæltet 34,København,1734,Danemark,31 12 34 56,31 13 35 57

# Les jointures externes 

<img src="https://raw.githubusercontent.com/rbizoi/Ecole-IA-Strasbourg/master/images/documents/M06-07.png" width="400">

In [23]:
%sql select count(*) from employes

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(111,)]

In [24]:
%sql select count(distinct no_employe) from commandes

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(92,)]

In [13]:
%%sql 
select count(*) lignes,
     count(distinct em.no_employe) as emp_employes ,
     count(distinct co.no_employe) as emp_commandes 
from employes em 
          left outer join commandes co 
               on em.no_employe = co.no_employe

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(13481, 111, 92)]

<img src="https://raw.githubusercontent.com/rbizoi/Ecole-IA-Strasbourg/master/images/documents/M06-08.png" width="400">

In [15]:
%%sql 
select em.no_employe,
       sum(port) port
from employes em 
  left outer join commandes co 
       on em.no_employe = co.no_employe 
group by em.no_employe 
order by port nulls first fetch next 25 rows only

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(64, None),
 (89, None),
 (23, None),
 (57, None),
 (14, None),
 (27, None),
 (109, None),
 (24, None),
 (95, None),
 (33, None),
 (18, None),
 (86, None),
 (75, None),
 (37, None),
 (11, None),
 (21, None),
 (30, None),
 (104, None),
 (44, None),
 (8, Decimal('1503.1')),
 (82, Decimal('1609.8')),
 (76, Decimal('1625.2')),
 (36, Decimal('1770.3')),
 (61, Decimal('1943.9')),
 (34, Decimal('2159.7'))]

In [16]:
%%sql 
select 
    count(*),
    count(distinct em.no_employe),
    count(distinct co.no_employe) 
from employes em 
  left outer join commandes co 
       on em.no_employe = co.no_employe 
where co.annee = 2010

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(7969, 92, 92)]

Toutefois la requête précédente ne retourne pas les employés qui n’ont pas passé de commande, car la condition ``annee = 2010`` impose également l’existence d’un enregistrement dans la table **COMMANDES**.

In [17]:
%%sql 
select count(*),
    count(distinct em.no_employe),
    count(distinct co.no_employe) 
from employes em 
  left outer join commandes co 
       on em.no_employe = co.no_employe 
where coalesce(co.annee,2010) = 2010

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(7988, 111, 92)]

In [19]:
%%sql 
select count(*),
     count(distinct em.no_employe),
     count(distinct co.no_employe) 
     from employes em 
          left outer join commandes co 
               on em.no_employe = co.no_employe 
          left join clients cl 
               on cl.code_client = co.code_client

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(13481, 111, 92)]

In [30]:
commandes = pd.read_sql_query("select * from commandes",connection)
employes  = pd.read_sql_query("select * from employes",connection).drop(columns=['pays','region'])
clients  = pd.read_sql_query("select * from clients",connection)

In [31]:
employes.set_index('no_employe').join(commandes.set_index('no_employe'),how='inner').shape

(13462, 20)

In [32]:
employes.set_index('no_employe').join(commandes.set_index('no_employe'),how='left').shape

(13481, 20)

Avec join c'est un peut casse tête à mon avis

In [33]:
employes.set_index(
                   'no_employe'
                   ).join(
                          commandes.set_index(
                                              'no_employe'
                                              ),
                           how='left'
                          ).reset_index().set_index(
                                                    'code_client'
                                                   ).join(
                                                          clients.set_index(
                                                                            'code_client'
                                                                            ),
                                                          how='left').shape

(13481, 27)

In [34]:
employes.merge(commandes,on='no_employe',how='left').merge(clients,on='code_client',how='left').shape

(13481, 28)